{"class_name": "Model", "config": {"name": "CNNLine", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_1", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_size": [3, 3], "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_2", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_3", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_4", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_5", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_6", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_size": [5, 5], "filters": 256, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_7", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_8", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_size": [3, 3], "filters": 512, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_9", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "global_max_horizontal_pooling2d_1", "class_name": "GlobalMaxHorizontalPooling2D", "config": {"name": "global_max_horizontal_pooling2d_1", "trainable": true, "data_format": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "up_sampling1d_1", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_1", "trainable": true, "size": 4}, "inbound_nodes": [[["global_max_horizontal_pooling2d_1", 0, 0, {}]]]}, {"name": "global_max_horizontal_pooling2d_2", "class_name": "GlobalMaxHorizontalPooling2D", "config": {"name": "global_max_horizontal_pooling2d_2", "trainable": true, "data_format": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 2}, "inbound_nodes": [[["up_sampling1d_1", 0, 0, {}], ["global_max_horizontal_pooling2d_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "kernel_size": [5], "filters": 256, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_10", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "kernel_size": [1], "filters": 256, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_11", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "up_sampling1d_2", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_2", "trainable": true, "size": 2}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "global_max_horizontal_pooling2d_3", "class_name": "GlobalMaxHorizontalPooling2D", "config": {"name": "global_max_horizontal_pooling2d_3", "trainable": true, "data_format": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 2}, "inbound_nodes": [[["up_sampling1d_2", 0, 0, {}], ["global_max_horizontal_pooling2d_3", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_12", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_13", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "kernel_size": [1], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_14", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_14", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "up_sampling1d_3", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_3", "trainable": true, "size": 2}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"name": "global_max_horizontal_pooling2d_4", "class_name": "GlobalMaxHorizontalPooling2D", "config": {"name": "global_max_horizontal_pooling2d_4", "trainable": true, "data_format": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": 2}, "inbound_nodes": [[["up_sampling1d_3", 0, 0, {}], ["global_max_horizontal_pooling2d_4", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_15", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_15", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_16", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_16", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv1d_8", "class_name": "Conv1D", "config": {"name": "conv1d_8", "kernel_size": [1], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_17", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_17", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "up_sampling1d_4", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_4", "trainable": true, "size": 2}, "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]]}, {"name": "global_max_horizontal_pooling2d_5", "class_name": "GlobalMaxHorizontalPooling2D", "config": {"name": "global_max_horizontal_pooling2d_5", "trainable": true, "data_format": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": 2}, "inbound_nodes": [[["up_sampling1d_4", 0, 0, {}], ["global_max_horizontal_pooling2d_5", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "conv1d_9", "class_name": "Conv1D", "config": {"name": "conv1d_9", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_18", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"name": "conv1d_10", "kernel_size": [3], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_19", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"name": "conv1d_11", "kernel_size": [1], "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "axis": -1, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.8, "name": "batch_normalization_20", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "alpha": 0.05000000074505806}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "last_conv", "class_name": "Conv1D", "config": {"name": "last_conv", "kernel_size": [1], "filters": 1, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "strides": [1], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}], "output_layers": [["last_conv", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4"}